docs/alpha-test-page.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-13 Mon 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ConfluxPortal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Conflux Team" />
</head>
<body>
<div id="content">
<h1 class="title">ConfluxPortal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ec46ed">1. ConfluxPortal</a>
<ul>
<li><a href="#org5eafbd4">1.1. Report bug/提交Bug</a></li>
<li><a href="#orgbc0d309">1.2. Download/下载</a></li>
<li><a href="#org39849e6">1.3. Install/安装</a>
<ul>
<li><a href="#orgc26d6a1">1.3.1. chrome</a></li>
<li><a href="#org7ab4257">1.3.2. firefox</a></li>
<li><a href="#org71fd18c">1.3.3. opera</a></li>
</ul>
</li>
<li><a href="#org651c6f2">1.4. Examples</a></li>
<li><a href="#org2a5b69f">1.5. Changelog</a>
<ul>
<li><a href="#org7098834">1.5.1. Unreleased</a></li>
<li><a href="#org511fd75">1.5.2. 0.0.2 - <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-10 Fri&gt;</span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0ec46ed" class="outline-2">
<h2 id="org0ec46ed"><span class="section-number-2">1</span> ConfluxPortal</h2>
<div class="outline-text-2" id="text-1">
<p>
Test version (extremely unstable) of Conflux MetaMask (wallet as a browser extension) that can
connect to Conflux test net.
</p>

<p>
Conflux 版本的 MetaMask (浏览器插件钱包), 目前为内部测试版本(非常不稳定), 能够连接 Conflux
测试网
</p>
</div>

<div id="outline-container-org5eafbd4" class="outline-3">
<h3 id="org5eafbd4"><span class="section-number-3">1.1</span> Report bug/提交Bug</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Please report any bug at our <a href="https://github.com/Conflux-Chain/metamask-extension/issues">github issue page</a>
</p>
</div>
</div>

<div id="outline-container-orgbc0d309" class="outline-3">
<h3 id="orgbc0d309"><span class="section-number-3">1.2</span> Download/下载</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://13.57.190.119:9000/metamask-chrome-0.0.2.zip">chrome</a></li>
<li><a href="http://13.57.190.119:9000/metamask-firefox-0.0.2.zip">firefox</a></li>
<li><a href="http://13.57.190.119:9000/metamask-opera-0.0.2.zip">opera</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39849e6" class="outline-3">
<h3 id="org39849e6"><span class="section-number-3">1.3</span> Install/安装</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgc26d6a1" class="outline-4">
<h4 id="orgc26d6a1"><span class="section-number-4">1.3.1</span> chrome</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Open <code>chrome://extensions/</code> through chrome location bar, drag the zip file into chrome.
</p>

<p>
在chrome地址栏中输入 <code>chrome://extensions/</code>, 将下载的 zip 文件拖拽到打开的页面中
</p>
</div>
</div>

<div id="outline-container-org7ab4257" class="outline-4">
<h4 id="org7ab4257"><span class="section-number-4">1.3.2</span> firefox</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Open <code>about:debugging#/runtime/this-firefox</code> through firefox location bar, load
the zip file through <b>Load Temporary Add-on</b> button.
</p>

<p>
在firefox地址栏中输入 <code>about:debugging#/runtime/this-firefox</code>, 点击加载临时插件
按钮, 选择 zip 文件.
</p>
</div>
</div>

<div id="outline-container-org71fd18c" class="outline-4">
<h4 id="org71fd18c"><span class="section-number-4">1.3.3</span> opera</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Open <code>opera://extensions</code> through opera location bar, turn developer mode, unzip
the zip file, use <b>Load unpacked</b> button to load the unziped folder.
</p>

<p>
在opera地址栏中输入 <code>opera://extensions</code>, 打开开发这模式, 解压zip文件, 通过加载
未打包插件按钮加载解压后的文件夹.
</p>
</div>
</div>
</div>

<div id="outline-container-org651c6f2" class="outline-3">
<h3 id="org651c6f2"><span class="section-number-3">1.4</span> Examples</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="http://13.57.190.119:9000/contract.html">example</a> for testing dapp functionalities (<a href="https://github.com/Conflux-Chain/metamask-extension/blob/cfx-develop/test/e2e/contract-test/contract.js">code</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org2a5b69f" class="outline-3">
<h3 id="org2a5b69f"><span class="section-number-3">1.5</span> Changelog</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org7098834" class="outline-4">
<h4 id="org7098834"><span class="section-number-4">1.5.1</span> Unreleased</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<ol class="org-ol">
<li><a id="org6dc4e05"></a>Change<br />
<div class="outline-text-5" id="text-1-5-1-1">
<ul class="org-ul">
<li>default gas price in inpage.js changed to 1 Gdrip (from 100 Drip)</li>
<li>default gas in inpage.js changed to 21000 (from 1000000)</li>
</ul>

<p>
Commits <a href="https://github.com/Conflux-Chain/metamask-extension/compare/0.0.2...HEAD">https://github.com/Conflux-Chain/metamask-extension/compare/0.0.2...HEAD</a>
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org511fd75" class="outline-4">
<h4 id="org511fd75"><span class="section-number-4">1.5.2</span> 0.0.2 - <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-10 Fri&gt;</span></span></h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>Some "Etherscan" to "Confluxscan"</li>
<li>Get default gas price from json rpc</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Conflux Team</p>
<p class="date">Created: 2020-01-13 Mon 18:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
